[
  {
    "subject": "[NUS] Offer of Admission",
    "body": "Dear XXX:\n\nOFFER OF ADMISSION TO THE NATIONAL UNIVERSITY OF SINGAPORE AS A FULL FEE PAYING UNDERGRADUATE\n\nI take great pleasure in offering you admission to the National University of Singapore for the following undergraduate degree programme(s) in Academic Year 2024:\n\nComputer Engineering\n\nWith your scholastic and personal accomplishments, alongside your potential for future academic success, we are confident that you will bring unique and valuable contributions to the NUS community.\n\nAs a leading global university, it is our mission to prepare you to be future-ready and to be your companion for lifelong learning. We will be a guiding bridge between your academic and work life — facilitating your engagement with potential employers and helping to hone important skillsets necessary for the future of work.\n\nWe offer a variety of cross-disciplinary programmes and global opportunities. Our curriculum is constantly refined to stay relevant to the industry. Beyond the requisites of an academic degree, we provide rigorous and broad-based programmes that enable you to delve into multiple knowledge domains that suit your strengths and interests.\n\nThe NUS experience is further complemented by a vibrant residential programme and a community enriched with diverse social and cultural perspectives.\n\nPlease note that as a full fee paying student, you are not eligible for the Tuition Grant, scholarships and/or financial aid administered by the Singapore Ministry of Education (MOE) or NUS. Full fee paying students also do not need to serve the Tuition Grant obligation to work for a Singapore-based company for three years upon graduation. The current annual tuition fees payable by students not in receipt of MOE Tuition Grants are set out in the https://www.nus.edu.sg/registrar/docs/info/administrative-policies-procedures/ugtuitioncurrent.pdf\n\nWe sincerely hope that you will join us and await your response to our offer of admission via the NUS acceptance portal (http://nus.edu/accept) by 14 July 2024.\n\nWe greatly look forward to welcoming you to the NUS family.\n\nYours sincerely,\n\nProf Tan Eng Chye\nPresident\nNational University of Singapore"
  }
]
